# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

**1. Import pandas as pd.**

In [3]:
import pandas as pd
import numpy as np
# import numpy as np

<br>

**2. Read `Salaries.csv` as a dataframe called `sal`.**

In [6]:
sal = pd.read_csv("Salaries.csv", index_col = 0 )

<br>

**3. Check the `head` of the DataFrame.**

In [8]:
sal.head(5)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [9]:
sal.tail(5)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
148650,Roy I Tillery,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

<br>

**4. Use the `.info()` method to find out how many entries there are.**

In [5]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

<br>

In [10]:
sal.describe()

,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [11]:
sal.shape()

TypeError: 'tuple' object is not callable

In [7]:
sal.count()

Id                  148654
EmployeeName        148654
JobTitle            148654
BasePay             148045
OvertimePay         148650
OtherPay            148650
Benefits            112491
TotalPay            148654
TotalPayBenefits    148654
Year                148654
Notes                    0
Agency              148654
Status                   0
dtype: int64

**5. What is the average `BasePay`?**

In [9]:
sal['BasePay'].mean()

66325.44884050643

<br>

**6. What is the highest amount of `OvertimePay` in the dataset?**

In [42]:
sal['OvertimePay'].max()

245131.88

<br>

**7. What is the `job title` of  `JOSEPH DRISCOLL`?**
> **Note:** Use all caps, otherwise you may get an answer that doesn't match up â€”there is a lowercase `Joseph Driscoll`).

In [30]:
idx = sal["EmployeeName"] == 'JOSEPH DRISCOLL'
sal['JobTitle'][idx]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

<br>

**8. How much does `JOSEPH DRISCOLL` make (including `benefits`)?**

In [43]:
sal['TotalPayBenefits'][idx]

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [45]:
sal['TotalPayBenefits'].describe()

count    148654.000000
mean      93692.554811
std       62793.533483
min        -618.130000
25%       44065.650000
50%       92404.090000
75%      132876.450000
max      567595.430000
Name: TotalPayBenefits, dtype: float64

<br>

**9. What is the `name` of `highest paid` person (including `benefits`)?**

In [49]:
sal["EmployeeName"][sal['TotalPayBenefits'].idxmax()]

'NATHANIEL FORD'

<br>

**10. What is the `name` of `lowest paid` person (including `benefits`)** 
> Do you notice something strange about how much he or she is paid?

In [54]:
sal["EmployeeName"][sal['TotalPayBenefits'].idxmin()]

'Joe Lopez'

In [59]:
sal.iloc[sal['TotalPayBenefits'].idxmin(), :]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                      0
OvertimePay                                  0
OtherPay                               -618.13
Benefits                                     0
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                     NaN
Name: 148653, dtype: object

<br>

**11. What was the average aka `mean` `BasePay` of all employees per year? (`2011-2014`)?**

In [14]:
yr =  np.logical_and( sal['Year'] >= 2011 , sal['Year'] <= 2014 )
sal['BasePay'][yr].mean()

66325.44884050643

In [19]:
sal.groupby('Year').mean()

,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes,Status
Year,,,,,,,,
2011,63595.956517,4531.065429,3617.081926,NaN,71744.103871,71744.103871,NaN,NaN
2012,65436.406857,5023.417824,3653.437583,26439.966967,74113.262265,100553.229232,NaN,NaN
2013,69630.030216,5281.641980,3819.969007,23829.076572,77611.443142,101440.519714,NaN,NaN
2014,66564.421924,5401.993737,3505.421251,24789.601756,75463.918140,100250.918884,NaN,NaN

In [25]:
sal.groupby('Year').max()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes,Agency,Status
Year,,,,,,,,,,,
2011,ZURI JONES,ZOO CURATOR,294580.02,245131.88,400184.25,NaN,567595.43,567595.43,NaN,San Francisco,NaN
2012,Zuri Jones,Youth Comm Advisor,302578.00,220909.48,245999.41,84681.82,362844.66,407274.78,NaN,San Francisco,NaN
2013,Zuri Jones,Youth Comm Advisor,319275.01,196689.18,202322.37,86533.21,347102.32,425815.28,NaN,San Francisco,NaN
2014,Zuri Jones,Youth Comm Advisor,318835.49,173547.73,342802.63,96570.66,471952.64,510732.68,NaN,San Francisco,NaN

<br>

**12. How many `unique` `job titles` are there?**

In [26]:
ir = sal.groupby('JobTitle')['JobTitle'].unique().count()
ir

2159

In [28]:
sal['JobTitle'].nunique()

2159

<br>

**13. What are the top 5 most common jobs?**

In [141]:
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

<br>

**14. How many Job Titles were represented by a single person, in 2013? (e.g. Job Titles with only one example in 2013?)**

In [32]:
yr2013 = sal["Year"] == 2013
sal[yr2013].groupby('JobTitle')['JobTitle'].unique().count()

1051

In [35]:
yr2013["JobTitle"].unique().count()

KeyError: 'JobTitle'

<br>

## Bonus

**<span style="color:red">Hard: </span> How many people have the word `Chief` in their job title?**

In [8]:
chief_sum = 0
for title in sal['JobTitle']: 
    if 'Chief' in title.split(" "):
        chief_sum += 1
print(chief_sum)

319

In [59]:
string = 'go DDD i am '

if string.lower().find('i am'.lower()) >= 0:
    print(string.lower().find('i am'))

7

In [9]:
chief_sum = 0
for title in sal['JobTitle']: 
    if a:
        chief_sum += 1
print(chief_sum)

SyntaxError: invalid syntax (<ipython-input-9-a13f15e330d0>, line 3)

<br>

In [39]:
sal['JobTitle'].str.contains("Chief").sum()

423